app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists" WHERE (lang LIKE '%java%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "gists" WHERE (lang LIKE '%java%')
---
 def index
    #@gists = Gist.all
    #@gists = Gist.paginate(page: params[:page], per_page: 8)
   @gists = Gist.paginate(:page => params[:page]).search(params[:search])

INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 27 Mar 2014 13:52:01 UTC +00:00], ["description", "zmienna"], ["lang", "C"], ["snippet", "int i;"], ["updated_at", Thu, 27 Mar 2014 13:52:01 UTC +00:00]]
---
  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save

UPDATE "gists" SET "snippet" = ?, "lang" = ?, "description" = ?, "updated_at" = ? WHERE "gists"."id" = 25  [["snippet", "double k;"], ["lang", "C"], ["description", "test"], ["updated_at", Thu, 03 Apr 2014 11:18:48 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]
---
  def destroy
    @gist.destroy

SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_gist
      @gist = Gist.find(params[:id])